package chapter01;

public class B_Settings {

	public static void main(String[] args) {

		// 주석
		// 코드 내에서 개발자의 의견이나 코드의 설명을 적는 것
		// >> 주석은 프로그램 코드 내에 삽입되더라도 프로그램 수행에 영향을 끼치지 않는다
		// >> 컴파일 시 주석은 자동으로 바이너리 코드에서 제거됨
		
		// 한 줄 주석 : // , 블록 주석(여러 줄 주석) : /* */
		System.out.println("컴파일 되는 코드");// 해당 영역은 실행 안됨
		/*
		 * 블록 주석의 내부는 실행되지 않음
		 */

		/*
		 * 		좋은 주석 사용법
		 * 1. 코드와 같은 라인에 작성하지 않기
		 * 2. 주석 뒤에 띄어쓰기 한 칸 첨부하기
		 * 3. 꼭 필요한 주석만 사용하기
		 */
		
		/*
		 * 자바의 블록 단위(클래스, 메서드 등)를 설명할 때 주로 사용
		 * >>프로젝트의 구조를 설명할 때 사용
		 * 여러 단위를 각각 설명
		 */
		
		/*
		   기본 여러 줄 주석		
		 */
		
		/*
		   eclipse 단축키
		   1. 자동완성
		   Ctrl + Space
		   2. 현재 줄 삭제
		   Ctrl + D
		   3. 코드 자동 정렬
		   Ctrl + Shift + F
		   4. 자동 import 정리
		   Ctrl + Shift + O
		   >> 외부 라이브러리, 외부 파일에 대한 import문 정리
		   5. 줄 이동
		   Alt + 위/아래 방향키
		   6. 줄 복사
		   Ctrl + Alt +위/아래 방향키
		   7. 실행
		   Ctrl + F11
		   8. 주석 생성/삭제
		   Ctrl + /
		 */
	}

}
